app/Http/Controllers/HomeController.php

select * from `posts` where `status` = 'PUBLISHED' and `featured` = 1 order by `id` desc limit 1
select * from `posts` where `status` = 'PUBLISHED' and `featured` = 1 order by `id` desc limit 2 offset 1
select * from `posts` where `status` = 'PUBLISHED' and `featured` = 1 order by `id` desc limit 3 offset 2
select * from `categories` where `order` = 1 and `frontpage` = 1 limit 1
select `id` from `categories` where `parent_id` = 44 or `id` = 44
select * from `posts` where `category_id` in (44) and `status` = 'PUBLISHED' order by `id` desc limit 1
select * from `posts` order by `id` desc limit 12
select * from `posts` order by `id` desc limit 12 offset 12
select * from `posts` where date(`created_at`) = '2022-06-10' order by `hit` desc
select * from `categories` where `order` = 2 and `frontpage` = 1 limit 1
select `id` from `categories` where `parent_id` = 1 or `id` = 1
select * from `posts` where `category_id` in (1, 49, 65) and `status` = 'PUBLISHED' order by `id` desc limit 4
select * from `posts` where `category_id` in (1, 49, 65) and `status` = 'PUBLISHED' order by `id` desc limit 7 offset 4
---
    public function index()
    {

        $data['adOne'] = Ad::whereOrder(1)->first();
        $data['adTwo'] = Ad::whereOrder(2)->first();
        $data['adThree'] = Ad::whereOrder(3)->first();
        $data['adFour'] = Ad::whereOrder(4)->first();
        $data['adFive'] = Ad::whereOrder(5)->first();
        $data['adSix'] = Ad::whereOrder(6)->first();

        $data['postOne'] = Post::whereStatus('PUBLISHED')->whereFeatured(1)->orderby('id','desc')->take(1)->get();
        $data['postTwo'] = Post::whereStatus('PUBLISHED')->whereFeatured(1)->orderby('id','desc')->skip(1)->take(2)->get();
        $data['postThree'] = Post::whereStatus('PUBLISHED')->whereFeatured(1)->orderby('id','desc')->skip(2)->take(3)->get();


        $data['cat'] = Category::whereOrder(1)->whereFrontpage(1)->first();
        $cat = Category::whereOrder(1)->whereFrontpage(1)->first();
        $pids = Category::where('parent_id', $cat->id)->orWhere('id', $cat->id)->pluck('id');
        $data['postFour'] = Post::whereIn('category_id',$pids)->whereStatus('PUBLISHED')->orderby('id','desc')->take(1)->get();



        $data['latestPosts'] = Post::orderby('id','desc')->take(12)->get();
        $data['posts'] = Post::orderby('id','desc')->skip(12)->take(12)->get();
        $data['topPosts'] = Post::whereDate('created_at','=', Carbon::today())->orderBy('hit', 'desc')->get();


        $data['catTwo'] = Category::whereOrder(2)->whereFrontpage(1)->first();
        $catTwo = Category::whereOrder(2)->whereFrontpage(1)->first();
        if ($catTwo ) {
            $pidsTwo = Category::where('parent_id', $catTwo->id)->orWhere('id', $catTwo->id)->pluck('id');
            $data['postFiveSecOne'] = Post::whereIn('category_id',$pidsTwo)->whereStatus('PUBLISHED')->orderby('id','desc')->take(4)->get();
            $data['postFiveSecTwo'] = Post::whereIn('category_id',$pidsTwo)->whereStatus('PUBLISHED')->orderby('id','desc')->skip(4)->take(7)->get();

select * from `categories` where `order` = 3 and `frontpage` = 1 limit 1
select `id` from `categories` where `parent_id` = 2 or `id` = 2
select * from `posts` where `category_id` in (2, 51) and `status` = 'PUBLISHED' order by `id` desc limit 5
select * from `categories` where `order` = 4 and `frontpage` = 1 limit 1
select `id` from `categories` where `parent_id` = 37 or `id` = 37
select * from `posts` where `category_id` in (37, 52, 66) and `status` = 'PUBLISHED' order by `id` desc limit 2
select * from `posts` where `category_id` in (37, 52, 66) and `status` = 'PUBLISHED' order by `id` desc limit 5 offset 2
select * from `posts` where `category_id` in (37, 52, 66) and `status` = 'PUBLISHED' order by `id` desc limit 5 offset 7
---



        $data['catThree'] = Category::whereOrder(3)->whereFrontpage(1)->first();
        $catThree = Category::whereOrder(3)->whereFrontpage(1)->first();
        if ($catThree) {
            $pidsThree = Category::where('parent_id', $catThree->id)->orWhere('id', $catThree->id)->pluck('id');
            $data['postSix'] = Post::whereIn('category_id',$pidsThree)->whereStatus('PUBLISHED')->orderby('id','desc')->take(5)->get();
        }


        $data['catFour'] = Category::whereOrder(4)->whereFrontpage(1)->first();
        $catFour = Category::whereOrder(4)->whereFrontpage(1)->first();
        if ($catFour) {
            $pidsFour = Category::where('parent_id', $catFour->id)->orWhere('id', $catFour->id)->pluck('id');
            $data['postSevenSecOne'] = Post::whereIn('category_id',$pidsFour)->whereStatus('PUBLISHED')->orderby('id','desc')->take(2)->get();
            $data['postSevenSecTwo'] = Post::whereIn('category_id',$pidsFour)->whereStatus('PUBLISHED')->orderby('id','desc')->skip(2)->take(5)->get();
            $data['postSevenSecThree'] = Post::whereIn('category_id',$pidsFour)->whereStatus('PUBLISHED')->orderby('id','desc')->skip(7)->take(5)->get();

select * from `categories` where `order` = 5 and `frontpage` = 1 limit 1
select `id` from `categories` where `parent_id` = 41 or `id` = 41
select * from `posts` where `category_id` in (41, 53, 54, 55) and `status` = 'PUBLISHED' order by `id` desc limit 4
select * from `posts` where `category_id` in (41, 53, 54, 55) and `status` = 'PUBLISHED' order by `id` desc limit 7 offset 4
select * from `posts` where `category_id` in (41, 53, 54, 55) and `status` = 'PUBLISHED' and `category_id` = 53 order by `id` desc limit 4
select * from `posts` where `category_id` in (41, 53, 54, 55) and `status` = 'PUBLISHED' and `category_id` = 53 order by `id` desc limit 7 offset 4
select * from `posts` where `category_id` in (41, 53, 54, 55) and `status` = 'PUBLISHED' and `category_id` = 54 order by `id` desc limit 4
select * from `posts` where `category_id` in (41, 53, 54, 55) and `status` = 'PUBLISHED' and `category_id` = 54 order by `id` desc limit 7 offset 4
select * from `categories` where `order` = 6 and `frontpage` = 1 limit 1
select `id` from `categories` where `parent_id` = 48 or `id` = 48
select * from `posts` where `category_id` in (48, 57) and `status` = 'PUBLISHED' order by `id` desc limit 1
select * from `posts` where `category_id` in (48, 57) and `status` = 'PUBLISHED' order by `id` desc limit 2 offset 1
---



        $data['catFive'] = Category::whereOrder(5)->whereFrontpage(1)->first();
        $catFive = Category::whereOrder(5)->whereFrontpage(1)->first();
        if ($catFive) {
            $pidsFive = Category::where('parent_id', $catFive->id)->orWhere('id', $catFive->id)->pluck('id');
            $data['postAllSecOne'] = Post::whereIn('category_id',$pidsFive)->whereStatus('PUBLISHED')->orderby('id','desc')->take(4)->get();
            $data['postAllSecTwo'] = Post::whereIn('category_id',$pidsFive)->whereStatus('PUBLISHED')->orderby('id','desc')->skip(4)->take(7)->get();

            $data['postCrickSecOne'] = Post::whereIn('category_id',$pidsFive)->whereStatus('PUBLISHED')->orderby('id','desc')->whereCategoryId(53)->take(4)->get();
            $data['postCrickSecTwo'] = Post::whereIn('category_id',$pidsFive)->whereStatus('PUBLISHED')->orderby('id','desc')->whereCategoryId(53)->skip(4)->take(7)->get();

            $data['postFootSecOne'] = Post::whereIn('category_id',$pidsFive)->whereStatus('PUBLISHED')->orderby('id','desc')->whereCategoryId(54)->take(4)->get();
            $data['postFootSecTwo'] = Post::whereIn('category_id',$pidsFive)->whereStatus('PUBLISHED')->orderby('id','desc')->whereCategoryId(54)->skip(4)->take(7)->get();
        }


        $data['catSix'] = Category::whereOrder(6)->whereFrontpage(1)->first();
        $catSix = Category::whereOrder(6)->whereFrontpage(1)->first();
        if ($catSix) {
            $pidsSix = Category::where('parent_id', $catSix->id)->orWhere('id', $catSix->id)->pluck('id');
            $data['postNineSecOne'] = Post::whereIn('category_id',$pidsSix)->whereStatus('PUBLISHED')->orderby('id','desc')->take(1)->get();
            $data['postNineSecTwo'] = Post::whereIn('category_id',$pidsSix)->whereStatus('PUBLISHED')->orderby('id','desc')->skip(1)->take(2)->get();

select * from `categories` where `order` = 7 and `frontpage` = 1 limit 1
select `id` from `categories` where `parent_id` = 42 or `id` = 42
select * from `posts` where `category_id` in (42, 58, 59, 60) and `status` = 'PUBLISHED' order by `id` desc limit 1
select * from `posts` where `category_id` in (42, 58, 59, 60) and `status` = 'PUBLISHED' order by `id` desc limit 2 offset 2
select * from `posts` where `category_id` in (42, 58, 59, 60) and `status` = 'PUBLISHED' order by `id` desc limit 3 offset 3
select * from `posts` where `category_id` in (42, 58, 59, 60) and `status` = 'PUBLISHED' order by `id` desc limit 1 offset 6
select * from `posts` where `category_id` in (42, 58, 59, 60) and `status` = 'PUBLISHED' order by `id` desc limit 2 offset 7
---



        $data['catSeven'] = Category::whereOrder(7)->whereFrontpage(1)->first();
        $catSeven = Category::whereOrder(7)->whereFrontpage(1)->first();
        if ($catSeven) {
            $pidsSeven = Category::where('parent_id', $catSeven->id)->orWhere('id', $catSeven->id)->pluck('id');

            $data['entertainAllSecOne'] = Post::whereIn('category_id',$pidsSeven)->whereStatus('PUBLISHED')->orderby('id','desc')->take(1)->get();

            $data['entertainAllSecTwo'] = Post::whereIn('category_id',$pidsSeven)->whereStatus('PUBLISHED')->orderby('id','desc')->skip(2)->take(2)->get();

            $data['entertainAllSecThree'] = Post::whereIn('category_id',$pidsSeven)->whereStatus('PUBLISHED')->orderby('id','desc')->skip(3)->take(3)->get();

            $data['entertainAllSecFoure'] = Post::whereIn('category_id',$pidsSeven)->whereStatus('PUBLISHED')->orderby('id','desc')->skip(6)->take(1)->get();

            $data['entertainAllSecFive'] = Post::whereIn('category_id',$pidsSeven)->whereStatus('PUBLISHED')->orderby('id','desc')->skip(7)->take(2)->get();

select * from `posts` where `category_id` in (42, 58, 59, 60) and `status` = 'PUBLISHED' and `category_id` = 60 order by `id` desc limit 1
select * from `posts` where `category_id` in (42, 58, 59, 60) and `status` = 'PUBLISHED' and `category_id` = 60 order by `id` desc limit 2 offset 2
select * from `posts` where `category_id` in (42, 58, 59, 60) and `status` = 'PUBLISHED' and `category_id` = 60 order by `id` desc limit 3 offset 3
select * from `posts` where `category_id` in (42, 58, 59, 60) and `status` = 'PUBLISHED' and `category_id` = 60 order by `id` desc limit 1 offset 6
select * from `posts` where `category_id` in (42, 58, 59, 60) and `status` = 'PUBLISHED' and `category_id` = 60 order by `id` desc limit 2 offset 7
---



            $data['dhlwodSecOne'] = Post::whereIn('category_id',$pidsSeven)->whereStatus('PUBLISHED')->orderby('id','desc')->whereCategoryId(60)->take(1)->get();

            $data['dhlwodSecTwo'] = Post::whereIn('category_id',$pidsSeven)->whereStatus('PUBLISHED')->orderby('id','desc')->whereCategoryId(60)->skip(2)->take(2)->get();

            $data['dhlwodSecThree'] = Post::whereIn('category_id',$pidsSeven)->whereStatus('PUBLISHED')->orderby('id','desc')->whereCategoryId(60)->skip(3)->take(3)->get();

            $data['dhlwodSecFoure'] = Post::whereIn('category_id',$pidsSeven)->whereStatus('PUBLISHED')->orderby('id','desc')->whereCategoryId(60)->skip(6)->take(1)->get();

            $data['dhlwodSecFive'] = Post::whereIn('category_id',$pidsSeven)->whereStatus('PUBLISHED')->orderby('id','desc')->whereCategoryId(60)->skip(7)->take(2)->get();

select * from `posts` where `category_id` in (42, 58, 59, 60) and `status` = 'PUBLISHED' and `category_id` = 59 order by `id` desc limit 1
select * from `posts` where `category_id` in (42, 58, 59, 60) and `status` = 'PUBLISHED' and `category_id` = 59 order by `id` desc limit 2 offset 2
select * from `posts` where `category_id` in (42, 58, 59, 60) and `status` = 'PUBLISHED' and `category_id` = 59 order by `id` desc limit 3 offset 3
select * from `posts` where `category_id` in (42, 58, 59, 60) and `status` = 'PUBLISHED' and `category_id` = 59 order by `id` desc limit 1 offset 6
select * from `posts` where `category_id` in (42, 58, 59, 60) and `status` = 'PUBLISHED' and `category_id` = 59 order by `id` desc limit 2 offset 7
select * from `posts` where `category_id` in (42, 58, 59, 60) and `status` = 'PUBLISHED' and `category_id` = 58 order by `id` desc limit 1
select * from `posts` where `category_id` in (42, 58, 59, 60) and `status` = 'PUBLISHED' and `category_id` = 58 order by `id` desc limit 2 offset 2
select * from `posts` where `category_id` in (42, 58, 59, 60) and `status` = 'PUBLISHED' and `category_id` = 58 order by `id` desc limit 3 offset 3
select * from `posts` where `category_id` in (42, 58, 59, 60) and `status` = 'PUBLISHED' and `category_id` = 58 order by `id` desc limit 1 offset 6
select * from `posts` where `category_id` in (42, 58, 59, 60) and `status` = 'PUBLISHED' and `category_id` = 58 order by `id` desc limit 2 offset 7
---



            $data['holwodSecOne'] = Post::whereIn('category_id',$pidsSeven)->whereStatus('PUBLISHED')->orderby('id','desc')->whereCategoryId(59)->take(1)->get();

            $data['holwodSecTwo'] = Post::whereIn('category_id',$pidsSeven)->whereStatus('PUBLISHED')->orderby('id','desc')->whereCategoryId(59)->skip(2)->take(2)->get();

            $data['holwodSecThree'] = Post::whereIn('category_id',$pidsSeven)->whereStatus('PUBLISHED')->orderby('id','desc')->whereCategoryId(59)->skip(3)->take(3)->get();

            $data['holwodSecFoure'] = Post::whereIn('category_id',$pidsSeven)->whereStatus('PUBLISHED')->orderby('id','desc')->whereCategoryId(59)->skip(6)->take(1)->get();

            $data['holwodSecFive'] = Post::whereIn('category_id',$pidsSeven)->whereStatus('PUBLISHED')->orderby('id','desc')->whereCategoryId(59)->skip(7)->take(2)->get();



            $data['bolwodSecOne'] = Post::whereIn('category_id',$pidsSeven)->whereStatus('PUBLISHED')->orderby('id','desc')->whereCategoryId(58)->take(1)->get();

            $data['bolwodSecTwo'] = Post::whereIn('category_id',$pidsSeven)->whereStatus('PUBLISHED')->orderby('id','desc')->whereCategoryId(58)->skip(2)->take(2)->get();

            $data['bolwodSecThree'] = Post::whereIn('category_id',$pidsSeven)->whereStatus('PUBLISHED')->orderby('id','desc')->whereCategoryId(58)->skip(3)->take(3)->get();

            $data['bolwodSecFoure'] = Post::whereIn('category_id',$pidsSeven)->whereStatus('PUBLISHED')->orderby('id','desc')->whereCategoryId(58)->skip(6)->take(1)->get();

            $data['bolwodSecFive'] = Post::whereIn('category_id',$pidsSeven)->whereStatus('PUBLISHED')->orderby('id','desc')->whereCategoryId(58)->skip(7)->take(2)->get();

select * from `categories` where `order` = 8 and `frontpage` = 1 limit 1
select `id` from `categories` where `parent_id` = 61 or `id` = 61
select * from `posts` where `category_id` in (61) and `status` = 'PUBLISHED' order by `id` desc limit 1
select * from `posts` where `category_id` in (61) and `status` = 'PUBLISHED' order by `id` desc limit 2 offset 1
select * from `categories` where `order` = 9 and `frontpage` = 1 limit 1
select `id` from `categories` where `parent_id` = 62 or `id` = 62
select * from `posts` where `category_id` in (62) and `status` = 'PUBLISHED' order by `id` desc limit 1
select * from `posts` where `category_id` in (62) and `status` = 'PUBLISHED' order by `id` desc limit 2 offset 1
select * from `categories` where `order` = 10 and `frontpage` = 1 limit 1
select `id` from `categories` where `parent_id` = 63 or `id` = 63
select * from `posts` where `category_id` in (63) and `status` = 'PUBLISHED' order by `id` desc limit 1
select * from `posts` where `category_id` in (63) and `status` = 'PUBLISHED' order by `id` desc limit 2 offset 1
select * from `categories` where `order` = 11 and `frontpage` = 1 limit 1
select `id` from `categories` where `parent_id` = 64 or `id` = 64
select * from `posts` where `category_id` in (64) and `status` = 'PUBLISHED' order by `id` desc limit 1
select * from `posts` where `category_id` in (64) and `status` = 'PUBLISHED' order by `id` desc limit 2 offset 1
select * from `locations` where `parent_id` is null
---



        $data['catEight'] = Category::whereOrder(8)->whereFrontpage(1)->first();
        $catEight = Category::whereOrder(8)->whereFrontpage(1)->first();
        if ($catEight) {
            $pidsEight = Category::where('parent_id', $catEight->id)->orWhere('id', $catEight->id)->pluck('id');
            $data['lifeSecOne'] = Post::whereIn('category_id',$pidsEight)->whereStatus('PUBLISHED')->orderby('id','desc')->take(1)->get();
            $data['lifeSecTwo'] = Post::whereIn('category_id',$pidsEight)->whereStatus('PUBLISHED')->orderby('id','desc')->skip(1)->take(2)->get();
        }


        $data['catNine'] = Category::whereOrder(9)->whereFrontpage(1)->first();
        $catNine = Category::whereOrder(9)->whereFrontpage(1)->first();
        if ($catNine) {
            $pidsNine = Category::where('parent_id', $catNine->id)->orWhere('id', $catNine->id)->pluck('id');
            $data['techSecOne'] = Post::whereIn('category_id',$pidsNine)->whereStatus('PUBLISHED')->orderby('id','desc')->take(1)->get();
            $data['techSecTwo'] = Post::whereIn('category_id',$pidsNine)->whereStatus('PUBLISHED')->orderby('id','desc')->skip(1)->take(2)->get();
        }


        $data['catTen'] = Category::whereOrder(10)->whereFrontpage(1)->first();
        $catTen = Category::whereOrder(10)->whereFrontpage(1)->first();
        if ($catTen) {
            $pidsTen = Category::where('parent_id', $catTen->id)->orWhere('id', $catTen->id)->pluck('id');
            $data['religionSecOne'] = Post::whereIn('category_id',$pidsTen)->whereStatus('PUBLISHED')->orderby('id','desc')->take(1)->get();
            $data['religionSecTwo'] = Post::whereIn('category_id',$pidsTen)->whereStatus('PUBLISHED')->orderby('id','desc')->skip(1)->take(2)->get();
        }


        $data['catEle'] = Category::whereOrder(11)->whereFrontpage(1)->first();
        $catEle = Category::whereOrder(11)->whereFrontpage(1)->first();
        if ($catEle) {
            $pidsEle = Category::where('parent_id', $catEle->id)->orWhere('id', $catEle->id)->pluck('id');
            $data['jobSecOne'] = Post::whereIn('category_id',$pidsEle)->whereStatus('PUBLISHED')->orderby('id','desc')->take(1)->get();
            $data['jobSecTwo'] = Post::whereIn('category_id',$pidsEle)->whereStatus('PUBLISHED')->orderby('id','desc')->skip(1)->take(2)->get();
        }


         $data['locations'] = Location::where('parent_id','=', null)->get();

select * from `locations` where `parent_id` = '1'
---
     public function subCat($id){
        echo json_encode(DB::table('locations')->where('parent_id', $id)->get());

select * from `locations` where `parent_id` is null
---
    public function country(Request $request)
    {
        $data['searchLocation'] = 0;
        $data['country'] = 1;

        $data['domain'] = $request->fullUrl();
        $data['locations'] = Location::where('parent_id','=', null)->get();

select * from `posts` where `location_id` = '2' order by `id` desc
select * from `locations` where `id` = '2' limit 1
select * from `locations` where `parent_id` = '1' and `id` != '2'
select * from `locations` where `parent_id` is null
---
    public function locationSearch(Request $request){

        $data['searchLocation'] = 1;
        $data['country'] = 0;
        // Get the search value from the request

        if ($request->input('division') || $request->input('upazila')) {
            $division = $request->input('division');
            $upazila = $request->input('upazila');

            if($upazila != null && $division != null){
                $data['allPosts'] = Post::where('location_id','=', $upazila)->orderby('id','desc')->get();
                $data['division'] = Location::where('id','=',$upazila)->first();
                 $data['allparentloc'] = Location::where('parent_id','=',$division)->where('id', '!=', $upazila)->get();
                 $data['upazila'] = Location::where('id','=',$upazila)->first();

            }elseif($division != null){

                $allparentloc = Location::where('parent_id','=',$division)->get();

                $data['allPosts'] = Post::where('location_id','=', $division)->orderby('id','desc')->get();

                $data['division'] = Location::where('id','=',$division)->first();

                $data['allparentloc'] = Location::where('parent_id','=',$division)->get();
            }
            $data['locations'] = Location::where('parent_id','=', null)->get();

select * from `locations` where `slug` = 'tangail' limit 1
---
    public function location($slug)
    {
        $data['searchLocation'] = 1;
        $data['country'] = 0;

        $locId = Location::whereSlug($slug)->first();

select * from `categories` where `slug` = 'national' limit 1
select * from `categories` where `categories`.`id` = 1 limit 1
select * from `categories` where `parent_id` = 1
select * from `posts`
select * from `posts` where `status` = 'PUBLISHED' and `featured` = 1 order by `id` desc limit 1
select * from `posts` where `status` = 'PUBLISHED' and `featured` = 1 order by `id` desc limit 2 offset 1
select * from `posts` where `status` = 'PUBLISHED' and `featured` = 0 order by `id` desc
select * from `posts` where `status` = 'PUBLISHED' and `created_at` >= '2022-06-03 14:53:41' order by `hit` desc limit 7
---
    public function posts($slug)
    {

        $cat = Category::whereSlug($slug)->first();

        // $catId = $cat->id;
        if ($cat) {
            // code...
        $data['checkcatId'] = $cat->id;
        $data['cats'] = Category::findOrFail($cat->id);

        $data['catTags'] = Category::whereParentId($cat->id)->get();
        }

        $post = Post::get();

        $data['featuredTopPosts'] = Post::whereStatus('PUBLISHED')->whereFeatured(1)->orderby('id','desc')->take(1)->get();

        $data['featuredSidePosts'] = Post::whereStatus('PUBLISHED')->whereFeatured(1)->orderby('id','desc')->skip(1)->take(2)->get();


        $data['allPosts'] = Post::whereStatus('PUBLISHED')->whereFeatured(0)->orderby('id','desc')->get();


         $date = Carbon::now()->subDays(7);

        $data['weeklyPosts'] = Post::whereStatus('PUBLISHED')->where('created_at', '>=', $date)->orderBy('hit', 'desc')->take(7)->get();

select * from `posts` where `slug` = 'bgbfbdfbdfbd' limit 1
select * from `posts` where `posts`.`id` = 114 limit 1
select * from `categories` where `categories`.`id` = 1 limit 1
select * from `posts` where `slug` != 'bgbfbdfbdfbd' and `category_id` = 1 and `status` = 'PUBLISHED' order by `id` desc limit 3
select * from `posts` where `slug` != 'bgbfbdfbdfbd' and `category_id` = 1 and `status` = 'PUBLISHED' order by `id` desc limit 5 offset 3
select * from `posts` where `slug` != 'bgbfbdfbdfbd' and `status` = 'PUBLISHED' order by RAND() limit 5
---
    public function singlePost($slug, Request $request)
    {
        $pid = Post::whereSlug($slug)->first();
        $data['adOne'] = Ad::whereOrder(1)->first();

        $shareslug = $pid->slug;
        $sharetitle = $pid->title;

        $post = Post::findOrFail($pid->id);

        $domain = $request->fullUrl();
        $data['domain'] = $request->fullUrl();
        // $domainname = $domain.$shareslug;

        $post['hit'] = $post->hit + 1;

        $post->save();

        $data['singlePost'] =Post::findOrFail($pid->id);

        $catId = Category::findOrFail($pid->category_id);

        if ($pid->category_id == $catId->id) {
            $data['cat'] = Category::findOrFail($catId->id);
        $cpid= Category::findOrFail($catId->id);
        $cpname = $cpid->name;
        $data['morePosts'] = Post::where('slug', '!=', $slug)->whereCategoryId($catId->id)->whereStatus('PUBLISHED')->orderby('id','desc')->take(3)->get();
        $data['relatedPosts'] = Post::where('slug', '!=', $slug)->whereCategoryId($catId->id)->whereStatus('PUBLISHED')->orderby('id','desc')->skip(3)->take(5)->get();
        $data['randomPosts'] = Post::where('slug', '!=', $slug)->whereStatus('PUBLISHED')->inRandomOrder()->take(5)->get();

select * from `menu_items` where `title` = 'জাতীয়'
---
        ->twitter()
        ->whatsapp()->getRawLinks();

        $data['menus'] = MenuItem::whereTitle($cpname)->get();

select * from `posts` where `status` = 'PUBLISHED' and date(`created_at`) = '2022-06-10' order by `id` desc
select * from `posts` where `status` = 'PUBLISHED' order by `hit` desc
---
     public function latestNews()
        {
            $data['search'] = 0;
            $data['latest'] = 1;
            $data['allPosts'] = Post::whereStatus('PUBLISHED')->whereDate('created_at','=', Carbon::today())->orderby('id','desc')->get();
            $data['topPosts'] = Post::whereStatus('PUBLISHED')->orderby('hit','desc')->get();